app/controllers/movies_controller.rb

  def index

		@class_title = nil
		@class_date = nil

		order = session[:order]
		if order == :title_asc
			@movies = Movie.order('title asc').all
			@class_title = :hilite
			session[:order] = :title_desc
		elsif order == :title_desc
			@movies = Movie.order('title desc').all
			@class_title = :hilite
			session[:order] = nil
		else
	    @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY title desc
SELECT "movies".* FROM "movies"